request4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="https://spring.io/guides/gs-movie-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getMovieRequest>
         <gs:name>Unforgiven</gs:name>
      </gs:getMovieRequest>
   </soapenv:Body>
</soapenv:Envelope>
